In [1]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.master("local").appName("spark-dataframe").getOrCreate()
spark

Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/03/28 11:09:56 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
!pip install pandas==1.5.3

Collecting pandas==1.5.3
  Downloading pandas-1.5.3-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (11 kB)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/ubuntu/miniconda3/envs/spark-env/lib/python3.8/site-packages (from pandas==1.5.3) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas==1.5.3)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting numpy>=1.20.3 (from pandas==1.5.3)
  Downloading numpy-1.24.4-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (5.6 kB)
Requirement already satisfied: six>=1.5 in /home/ubuntu/miniconda3/envs/spark-env/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas==1.5.3) (1.16.0)
Downloading pandas-1.5.3-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.2/12.2 MB 66.3 MB/s eta 0:00:00:00:01:01
Downloading numpy-1.24.4-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (17.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 17.3/17.3 MB 59.0 MB/s eta 0:00:00:00:0100:01
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 36.3 MB/s eta 0:00:00
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.4 pandas-1.5.3 pytz-2024.1

In [6]:
filepath = "/home/ubuntu/working/spark/data/titanic_train.csv"

# inferSchema : 컬럼 타입을 자동으로 추론
titanic_sdf = spark.read.csv(filepath, inferSchema=True, header=True)
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [3]:
!pwd

/home/ubuntu/working/spark

In [4]:
!ls data

1800.csv  fakefriends.csv	  titanic_train.csv  xAPI-Edu-Data.csv
Book	  restaurant_reviews.csv  u.data

In [7]:
titanic_sdf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [8]:
titanic_sdf.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

# Pandas DataFrame과 비교

In [15]:
import pandas as pd

titanic_pdf = pd.read_csv(filepath)
titanic_pdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
# Spark DataFrame 에서 Head를 사용하면 Row 객체가 등장한다 -> RDD 프로그래밍이 가능하다
titanic_sdf.head(5)

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S')]

In [16]:
print(titanic_pdf)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [14]:
print(titanic_sdf)

DataFrame[PassengerId: int, Survived: int, Pclass: int, Name: string, Sex: string, Age: double, SibSp: int, Parch: int, Ticket: string, Fare: double, Cabin: string, Embarked: string]

In [17]:
# Spark DataFrame -> Pandas DataFrame
#  분산 처리 시스템이 더 이상 필요 없을 때
titanic_sdf.toPandas()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [18]:
# 문자열에 대한 통계 정보는 나오지 않는다
# 숫자 데이터에 대한 통계 정보만 확인 가능!
titanic_pdf.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [19]:
titanic_sdf.describe().show()

+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|summary|      PassengerId|           Survived|            Pclass|                Name|   Sex|               Age|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|  count|              891|                891|               891|                 891|   891|               714|               891|                891|               891|              891|  204|     889|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642|                null|  null| 29.69911764705882|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| null|    null|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|                null|  null|14.526497332334035|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| null|    null|
|    min|                1|                  0|                 1|"Andersson, Mr. A...|female|              0.42|                 0|                  0|            110152|              0.0|  A10|       C|
|    max|              891|                  1|                 3|van Melkebeke, Mr...|  male|              80.0|                 8|                  6|         WE/P 5735|         512.3292|    T|       S|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+

In [20]:
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [22]:
num_cols = [ column_name for column_name, dtype in titanic_sdf.dtypes if dtype != 'string']
num_cols

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [24]:
titanic_sdf.select(num_cols).describe().show()

+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|summary|      PassengerId|           Survived|            Pclass|               Age|             SibSp|              Parch|             Fare|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|  count|              891|                891|               891|               714|               891|                891|              891|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|
|    min|                1|                  0|                 1|              0.42|                 0|                  0|              0.0|
|    max|              891|                  1|                 3|              80.0|                 8|                  6|         512.3292|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+

In [25]:
# shape, 판다스 데이터 프레임은 shape을 통해 행과 열의 개수를 동시에 파악할 수 있다
titanic_pdf.shape

(891, 12)

In [27]:
# 스파크 데이터 프레임은 행의 개수와 열의 개수를 따로 따로 확인 할 수 있다
len(titanic_sdf.columns)

12

In [28]:
titanic_sdf.count() # 데이터의 개수(행의 개수) 구하기

891

# Spark DataFrame의 select() 메소드 알아보기⭐️
- `select` 메소드는 SQL의 SELECT절과 매우 흡사하게 한 개 이상의 컬럼들의 값을 **DATAFRAME** 형식으로 반환
- 한 개의 컬럼명 또는 여러 개의 컬럼명을 인자로 받을 수 있다.
    - 개별 컬럼명을 문자열 형태로 또는 DataFrame의 컬럼 속성으로 지정
- DataFrame의 컬럼 속성으로 지정할 시에는 DataFrame.컬럼명, DataFrame[컬럼명], `col(컬럼명)`으로 지정

In [29]:
# Pandas 데이터 프레임에서 단일 컬럼 값 가져오기
titanic_pdf['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [30]:
titanic_pdf[["Name", "Age"]]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [32]:
# Spark의 Select는 Transformation 형태이므로 show()를 해줘야됨
titanic_sdf.select("Name").show()

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [33]:
titanic_sdf.select("Name", "Age").show()

+--------------------+----+
|                Name| Age|
+--------------------+----+
|Braund, Mr. Owen ...|22.0|
|Cumings, Mrs. Joh...|38.0|
|Heikkinen, Miss. ...|26.0|
|Futrelle, Mrs. Ja...|35.0|
|Allen, Mr. Willia...|35.0|
|    Moran, Mr. James|null|
|McCarthy, Mr. Tim...|54.0|
|Palsson, Master. ...| 2.0|
|Johnson, Mrs. Osc...|27.0|
|Nasser, Mrs. Nich...|14.0|
|Sandstrom, Miss. ...| 4.0|
|Bonnell, Miss. El...|58.0|
|Saundercock, Mr. ...|20.0|
|Andersson, Mr. An...|39.0|
|Vestrom, Miss. Hu...|14.0|
|Hewlett, Mrs. (Ma...|55.0|
|Rice, Master. Eugene| 2.0|
|Williams, Mr. Cha...|null|
|Vander Planke, Mr...|31.0|
|Masselmani, Mrs. ...|null|
+--------------------+----+
only showing top 20 rows

In [36]:
# 리스트를 활용해서 select
select_columns = ['Name', "Age", "Pclass", "Fare"]

# 구번전(2.X) 조회
titanic_sdf.select(*select_columns).show()

print()
# 신 버전(3.X) 조회
titanic_sdf.select(select_columns).show()

+--------------------+----+------+-------+
|                Name| Age|Pclass|   Fare|
+--------------------+----+------+-------+
|Braund, Mr. Owen ...|22.0|     3|   7.25|
|Cumings, Mrs. Joh...|38.0|     1|71.2833|
|Heikkinen, Miss. ...|26.0|     3|  7.925|
|Futrelle, Mrs. Ja...|35.0|     1|   53.1|
|Allen, Mr. Willia...|35.0|     3|   8.05|
|    Moran, Mr. James|null|     3| 8.4583|
|McCarthy, Mr. Tim...|54.0|     1|51.8625|
|Palsson, Master. ...| 2.0|     3| 21.075|
|Johnson, Mrs. Osc...|27.0|     3|11.1333|
|Nasser, Mrs. Nich...|14.0|     2|30.0708|
|Sandstrom, Miss. ...| 4.0|     3|   16.7|
|Bonnell, Miss. El...|58.0|     1|  26.55|
|Saundercock, Mr. ...|20.0|     3|   8.05|
|Andersson, Mr. An...|39.0|     3| 31.275|
|Vestrom, Miss. Hu...|14.0|     3| 7.8542|
|Hewlett, Mrs. (Ma...|55.0|     2|   16.0|
|Rice, Master. Eugene| 2.0|     3| 29.125|
|Williams, Mr. Cha...|null|     2|   13.0|
|Vander Planke, Mr...|31.0|     3|   18.0|
|Masselmani, Mrs. ...|null|     3|  7.225|
+--------------------+----+------+-------+
only showing top 20 rows


+--------------------+----+------+-------+
|                Name| Age|Pclass|   Fare|
+--------------------+----+------+-------+
|Braund, Mr. Owen ...|22.0|     3|   7.25|
|Cumings, Mrs. Joh...|38.0|     1|71.2833|
|Heikkinen, Miss. ...|26.0|     3|  7.925|
|Futrelle, Mrs. Ja...|35.0|     1|   53.1|
|Allen, Mr. Willia...|35.0|     3|   8.05|
|    Moran, Mr. James|null|     3| 8.4583|
|McCarthy, Mr. Tim...|54.0|     1|51.8625|
|Palsson, Master. ...| 2.0|     3| 21.075|
|Johnson, Mrs. Osc...|27.0|     3|11.1333|
|Nasser, Mrs. Nich...|14.0|     2|30.0708|
|Sandstrom, Miss. ...| 4.0|     3|   16.7|
|Bonnell, Miss. El...|58.0|     1|  26.55|
|Saundercock, Mr. ...|20.0|     3|   8.05|
|Andersson, Mr. An...|39.0|     3| 31.275|
|Vestrom, Miss. Hu...|14.0|     3| 7.8542|
|Hewlett, Mrs. (Ma...|55.0|     2|   16.0|
|Rice, Master. Eugene| 2.0|     3| 29.125|
|Williams, Mr. Cha...|null|     2|   13.0|
|Vander Planke, Mr...|31.0|     3|   18.0|
|Masselmani, Mrs. ...|null|     3|  7.225|
+--------------------+----+------+-------+
only showing top 20 rows

# 컬럼 속성 이해하기

In [39]:
# 브라켓 ( [ ] ) 사용하기
titanic_sdf.select( [
    titanic_sdf["Fare"],
    titanic_sdf["Fare"] * 100
]).show()

+-------+-----------------+
|   Fare|     (Fare * 100)|
+-------+-----------------+
|   7.25|            725.0|
|71.2833|          7128.33|
|  7.925|            792.5|
|   53.1|           5310.0|
|   8.05|805.0000000000001|
| 8.4583|845.8299999999999|
|51.8625|          5186.25|
| 21.075|           2107.5|
|11.1333|          1113.33|
|30.0708|          3007.08|
|   16.7|           1670.0|
|  26.55|           2655.0|
|   8.05|805.0000000000001|
| 31.275|           3127.5|
| 7.8542|           785.42|
|   16.0|           1600.0|
| 29.125|           2912.5|
|   13.0|           1300.0|
|   18.0|           1800.0|
|  7.225|            722.5|
+-------+-----------------+
only showing top 20 rows

In [40]:
# 마치 SQL SELECT 절과 비슷함
titanic_sdf["Fare"] * 100

Column<'(Fare * 100)'>

In [41]:
titanic_sdf.Fare * 100

Column<'(Fare * 100)'>

In [ ]:
# 이 두 가지 방법으로 컬럼 속성 다루는 건 비 추천! 불편함

In [43]:
import pyspark.sql.functions as F

F.col("Fare") * 100

Column<'(Fare * 100)'>

스파크 데이터프레임에서 컬럼을 다룰 때 가장 많이 사용하는 방식
- `col`
- Spark SQL에서 사용되는 모든 연산이 들어있는 패키지인 `pyspark.sql.functions`에서 import

In [46]:
titanic_sdf.select(
    F.col("Name"),
    F.col("Fare")
).show()

+--------------------+-------+
|                Name|   Fare|
+--------------------+-------+
|Braund, Mr. Owen ...|   7.25|
|Cumings, Mrs. Joh...|71.2833|
|Heikkinen, Miss. ...|  7.925|
|Futrelle, Mrs. Ja...|   53.1|
|Allen, Mr. Willia...|   8.05|
|    Moran, Mr. James| 8.4583|
|McCarthy, Mr. Tim...|51.8625|
|Palsson, Master. ...| 21.075|
|Johnson, Mrs. Osc...|11.1333|
|Nasser, Mrs. Nich...|30.0708|
|Sandstrom, Miss. ...|   16.7|
|Bonnell, Miss. El...|  26.55|
|Saundercock, Mr. ...|   8.05|
|Andersson, Mr. An...| 31.275|
|Vestrom, Miss. Hu...| 7.8542|
|Hewlett, Mrs. (Ma...|   16.0|
|Rice, Master. Eugene| 29.125|
|Williams, Mr. Cha...|   13.0|
|Vander Planke, Mr...|   18.0|
|Masselmani, Mrs. ...|  7.225|
+--------------------+-------+
only showing top 20 rows

In [52]:
titanic_sdf.select(
    F.col("Name"),
    F.upper(F.col("Name")).alias("Cap Name")
).show()

+--------------------+--------------------+
|                Name|            Cap Name|
+--------------------+--------------------+
|Braund, Mr. Owen ...|BRAUND, MR. OWEN ...|
|Cumings, Mrs. Joh...|CUMINGS, MRS. JOH...|
|Heikkinen, Miss. ...|HEIKKINEN, MISS. ...|
|Futrelle, Mrs. Ja...|FUTRELLE, MRS. JA...|
|Allen, Mr. Willia...|ALLEN, MR. WILLIA...|
|    Moran, Mr. James|    MORAN, MR. JAMES|
|McCarthy, Mr. Tim...|MCCARTHY, MR. TIM...|
|Palsson, Master. ...|PALSSON, MASTER. ...|
|Johnson, Mrs. Osc...|JOHNSON, MRS. OSC...|
|Nasser, Mrs. Nich...|NASSER, MRS. NICH...|
|Sandstrom, Miss. ...|SANDSTROM, MISS. ...|
|Bonnell, Miss. El...|BONNELL, MISS. EL...|
|Saundercock, Mr. ...|SAUNDERCOCK, MR. ...|
|Andersson, Mr. An...|ANDERSSON, MR. AN...|
|Vestrom, Miss. Hu...|VESTROM, MISS. HU...|
|Hewlett, Mrs. (Ma...|HEWLETT, MRS. (MA...|
|Rice, Master. Eugene|RICE, MASTER. EUGENE|
|Williams, Mr. Cha...|WILLIAMS, MR. CHA...|
|Vander Planke, Mr...|VANDER PLANKE, MR...|
|Masselmani, Mrs. ...|MASSELMANI, MRS. ...|
+--------------------+--------------------+
only showing top 20 rows

# Spark DataFrame의 filter() 메소드 알아보기
- `filter()`는 SQL의 WHERE과 매우 흡사하게 특정 조건을 만족하는 레코드를 DataFrame으로 반환.
- `filter()`내의 조건 컬럼은 컬럼 속성으로 지정이 가능.
- 조건문 자체는 SQL과 유사한 문자열로 지정할 수 있다.
    - 단, 조건 컬럼은 문자열 지정이 안된다.
- `where` 메소드는 filter의 alias 버전이며, where과 직관적인 동일성을 간주하기 위해 생성.
- 복합 조건 and는 &를, or는 | 를 사용. 개별 조건은 괄호()로 감싸야 한다.

In [54]:
titanic_sdf.filter(
    F.col("Embarked") == "Q"

).show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [55]:
titanic_sdf.where(
    F.col("Embarked") == "Q"
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [57]:
# AND -> &

titanic_sdf.filter(
    (F.col("Embarked") == "S") & (F.col("Pclass") == 1)
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|     113803|   53.1|       C123|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463|51.8625|        E46|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|  26.55|       C103|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|     113788|   35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|      19950|  263.0|C23 C25 C27|       S|
|         36|       0|     1|Holverson, Mr. Al...|  male|42.0|    1|    0|     113789|   52.0|       null|       S|
|         56|       1|     1|   Woolner, Mr. Hugh|  male|null|    0|    0|      19947|   35.5|        C52|       S|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|      36973| 83.475|        C83|       S|
|         84|       0|     1|Carrau, Mr. Franc...|  male|28.0|    0|    0|     113059|   47.1|       null|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|      19950|  263.0|C23 C25 C27|       S|
|         93|       0|     1|Chaffee, Mr. Herb...|  male|46.0|    1|    0|W.E.P. 5734| 61.175|        E31|       S|
|        103|       0|     1|White, Mr. Richar...|  male|21.0|    0|    1|      35281|77.2875|        D26|       S|
|        111|       0|     1|Porter, Mr. Walte...|  male|47.0|    0|    0|     110465|   52.0|       C110|       S|
|        125|       0|     1|White, Mr. Perciv...|  male|54.0|    0|    1|      35281|77.2875|        D26|       S|
|        137|       1|     1|Newsom, Miss. Hel...|female|19.0|    0|    2|      11752|26.2833|        D47|       S|
|        138|       0|     1|Futrelle, Mr. Jac...|  male|37.0|    1|    0|     113803|   53.1|       C123|       S|
|        152|       1|     1|Pears, Mrs. Thoma...|female|22.0|    1|    0|     113776|   66.6|         C2|       S|
|        167|       1|     1|Chibnall, Mrs. (E...|female|null|    0|    1|     113505|   55.0|        E33|       S|
|        169|       0|     1| Baumann, Mr. John D|  male|null|    0|    0|   PC 17318| 25.925|       null|       S|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|     111240|   33.5|        B19|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
only showing top 20 rows

In [58]:
# OR -> | 

titanic_sdf.filter(
    (F.col("Embarked") == "S") | (F.col("Pclass") == 2)
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         21|       0|     2|Fynney, Mr. Joseph J|  male|35.0|    0|    0|          239865|   26.0| null|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|          248698|   13.0|  D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|          113788|   35.5|   A6|       S|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [60]:
# LIKE 는 연산자, UPPER 는 함수 적용(F.upper("Miss"))
F.col("Miss").like("%Miss%")

Column<'Miss LIKE %Miss%'>

In [61]:
titanic_sdf.filter(
    F.col("Name").like("%Miss%")
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123|41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958| 7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|      C.A. 31026|   10.5| null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|      C.A. 34651|  27.75| null|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|          113572|   80.0|  B28|    null|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|         3101281|  7.925| null|       S|
|         72|       0|     3|Goodwin, Miss. Li...|female|16.0|    5|    2|         CA 2144|   46.9| null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|          364516| 12.475| null|       S|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|          330932| 7.7875| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [62]:
titanic_sdf.filter(
    "Name like '%Miss%'"
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123|41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958| 7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|      C.A. 31026|   10.5| null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|      C.A. 34651|  27.75| null|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|          113572|   80.0|  B28|    null|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|         3101281|  7.925| null|       S|
|         72|       0|     3|Goodwin, Miss. Li...|female|16.0|    5|    2|         CA 2144|   46.9| null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|          364516| 12.475| null|       S|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|          330932| 7.7875| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [68]:
titanic_sdf.filter(
    F.lower(F.col("Name")).like("%h"),
).select(
    F.upper(F.col("Name"))
).show()

+--------------------+
|         upper(Name)|
+--------------------+
|BONNELL, MISS. EL...|
|WHEADON, MR. EDWA...|
|MEYER, MR. EDGAR ...|
|   WOOLNER, MR. HUGH|
|DOWDELL, MISS. EL...|
|SHORNEY, MR. CHAR...|
|FUTRELLE, MR. JAC...|
| BURKE, MR. JEREMIAH|
|SMITH, MR. JAMES ...|
|ISHAM, MISS. ANN ...|
|BRACKEN, MR. JAMES H|
|NATSCH, MR. CHARL...|
|FORTUNE, MISS. AL...|
|BOWERMAN, MISS. E...|
|  GALE, MR. SHADRACH|
| PEDUZZI, MR. JOSEPH|
|   GEE, MR. ARTHUR H|
|BISHOP, MR. DICKI...|
|ANDERSSON, MISS. ...|
| TAUSSIG, MISS. RUTH|
+--------------------+
only showing top 20 rows

In [69]:
spark.stop()